#11
print('Задание 11. Напишите программу для ввода шестнадцатеричного числа и вывода его в десятичной системе.')
x = input ('Введите число в двоичном формате: ')
x = int(x, 16)
print('Ответ:', x)
input ('')
