#12
print('Задание 12. Напишите программу для преобразования двоичного числа в шестнадцатеричное и обратно.')
x = input('Введите число в двоичном формате: ')
x=int(x,2)
print ('Ответ: десятичное число равно:', x)
x=hex(x)
print ('Ответ: шестнадцетиричное число равно:', x)
x=int(x, 16)
x=bin(x)
print ('Ответ: двоичное число равно:', x)
input ('')
